app/controllers/v1/posts_controller.rb

    def user_authenticate
      @current_user = User.first
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]