app/controllers/v1/posts_controller.rb

  def index
    posts = []
    Post.paginate(page: params[:page], per_page: params[:per_page]).order('published_at DESC').each{ |post|
---
SELECT COUNT(*) FROM "posts"
SELECT  "posts".* FROM "posts" ORDER BY published_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]

  def create
    create_params = {
      :title => params[:title],
      :body => params[:body],
      :published_at => params[:published_at],
      :author => @current_user[:nickname]
    }
    create_params[:published_at] = Time.now if params[:published_at].nil?

    @post = @current_user.posts.new(create_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "author", "published_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def find_user
      @user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]