app/controllers/v1/reports_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1000]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."published_at" BETWEEN $2 AND $3  [["user_id", 1], ["published_at", nil], ["published_at", nil]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."author" = $1 AND "comments"."published_at" BETWEEN $2 AND $3  [["author", "example"], ["published_at", "2010-01-01 00:00:00"], ["published_at", "2020-01-01 00:00:00"]]
---
  def generate
    needed_params
    records = []
    User.find_each do |user|
      posts_amount = user.posts.where(published_at: params[:start_date]..params[:end_date]).count
      comments_amount = Comment.where(author: user.nickname, published_at: params[:start_date]..params[:end_date]).count