app/controllers/v1/users_controller.rb

UPDATE "users" SET "photo_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["photo_url", "https://unavailabl3.s3.us-east-2.amazonaws.com/RackMultipart20190208-42657-sswwgf.jpg"], ["updated_at", "2019-02-08 15:22:33.498478"], ["id", 1]]
---
  def edit
    @user.update_attribute(:photo_url, params[:photo_url])

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "example@mail.com"], ["LIMIT", 1]]
---
    def find_user
      @user = User.find_by_email(params[:email])